<template>
  <v-container fluid class="mx-auto pa-0">
      <div class="primary hidden-sm-and-down">
        <h2 class="ml-2">Описание основных возможностей приложения</h2>
      </div>
    <v-card class="pa-xl-5 pa-lg-5 pa-md-4 pa-sm-2 pa-xs-0 ma-xs-0 blue-grey lighten-4" tile >
      <v-card class="mx-auto" outlined tile light color="white">
        <v-card-title class="headline font-weight-light"></v-card-title>
        <v-card-subtitle
          class="primary--text font-weight-light"
        >Программа создана для использования инженерами-наладчиками для настройки и диагностики работы ПИД-регуляторов котловой автоматики</v-card-subtitle>
        <v-card-text>
          <p class="mb-0 primary--text text-uppercase">
            <b>Особенности работы с приложением:</b>
          </p>
          <ul>
            <li>Приложение не требует драйверов и дополнительных настроек связи с контроллерами Siemens</li>
            <li>Приложение должно запускаться с компьютера, находящегося в одной локальной сети с контроллерами шкафов ШАУ</li>
            <li>Приложение не требует настройки базы данных - все данные адаптированы для хранения в оперативной памяти "по изменению"</li>
            <li>Цикл опроса контроллера можно динамически менять в процессе работы от минимально возможного в несколько миллисекунд до нескольких секунд</li>
            <li>Опрос можно начать нажав на кнопку ЗАПУСК, а затем приостановить, нажав ОСТАНОВ (при этом данные не удалятся). При последующем нажатии ЗАПУСК запись продолжится</li>
            <li>При запущенном опросе данные на графике обновляются автоматически, отображаются данные только за определенный промежуток времени. Можно увеличивать и уменьшать графики без остановки опроса</li>
            <li>Для просмотра всей записанной истории необходимо остановить опрос, графики переключатся в режим истории</li>
            <li>Для подтверждения ввода уставок необходимо либо нажать ENTER, либо щелкнуть вне поля, выделенного цветной рамкой</li> 
            <li>Возможно управление механизмами регулирующих органов РО в ручном режиме с помощью кнопок ОТКРЫТЬ, ЗАКРЫТЬ, а также ПУСК, СТОП с уставкой скорости</li>
            <li>При цикле опроса более 500 мс блокируется возможность управления и изменения уставок</li>
            <li>Записанные данные могут быть удалены нажатием кнопки ОЧИСТКА</li>
            <li>При переключении между регуляторами в пределах одного котла запущенный опрос НЕ приостанавливается, необходим контроль пользователя</li>
            <li>При переключении между котлами все накопленные данные удаляются</li>
            <li>Графики можно перевести в полноэкранный режим и обратно кнопкой в правом верхнем углу графиков</li>
            <li>Графики можно увеличивать с помощью колеса мыши или выделением периода времени</li>
            <li>Графики в режиме остановленного опроса можно детально изучать с помошью интерактивной шкалы времени и визирной линии</li>
            <li>Можно скрывать или показывать отдельные тренды с помощью щелчка на названии тренда в легенде</li>
          </ul>
          <br />
        </v-card-text>
      </v-card>
    </v-card>
  </v-container>
</template>

<script>
export default {
  name: "home",
  computed: {
  },
  methods: {
  },
  data: () => ({
  })
};
</script>

<style scoped>
p, ul, li {
  font-size: 12pt;
   }
</style>